In [1]:
import pandas

In [2]:
print(dir(pandas))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__deprecated_num_index_names', '__dir__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [ ]:
outside data to inside data>

In [ ]:
int_var=20
name_str="paramatma"
list_valu=[1,2,3,4,5]
dict_value={"name":["ravi","rakesh"]}

In [ ]:
read_csv,read_table

In [3]:
import pandas as pd

In [ ]:
pd.read_table(path,delimiter,header)

In [ ]:

es
\n--
\t

In [4]:
df=pd.read_table(r"D:\pandas_practise\customer_details_v2.txt",delimiter=",")

In [5]:
df

     name  location
0    ravi     mtm-1
1  rakesh     mtm-2
2    roja    vija-1
3  rajesh    vija-2
4   param    guduru
5  param2  patanpet

In [ ]:
df_csv=pd.read_csv(path,header,delimiter)

In [6]:
df_csv=pd.read_csv("D:\\pandas_practise\\customer_details_v2.txt",delimiter=",")

In [7]:
df_csv

     name  location
0    ravi     mtm-1
1  rakesh     mtm-2
2    roja    vija-1
3  rajesh    vija-2
4   param    guduru
5  param2  patanpet

In [ ]:
pd.read_excel(path,header,sheet_name)

In [8]:
df_excel=pd.read_excel("D:\pandas_practise\cusotmer_details_excel.xlsx",sheet_name="Sheet1")

In [9]:
df_excel

     name  location
0  param1       mtm
1  param2     mtm-1
2   athma     vja-1
3  athma2     vja-2
4    ravi    guduru
5  rakesh  patanpet

In [10]:
df_excel_v1=pd.read_excel("D:\pandas_practise\cusotmer_details_excel.xlsx",sheet_name="Sheet2")

In [11]:
df_excel_v1

     name  location   TV
0  param1       mtm  yes
1  param2     mtm-1  yes
2   athma     vja-1  yes
3  athma2     vja-2   no
4    ravi    guduru   no
5  rakesh  patanpet   no

In [ ]:
database

sql----->

rows-->columns

In [ ]:
# basic checks
shape-->no.of rows no.of columns

In [12]:
df_excel_v1.shape

(6, 3)

In [ ]:
columns---> it display only columns details

In [14]:
colu_list=df_excel_v1.columns

In [15]:
colu_list

Index(['name', 'location', 'TV'], dtype='object')

In [16]:
for i in colu_list:
    print(i)

name
location
TV

In [ ]:
head(10)--top rows display
tail(5)----bottom rows display

In [17]:
df_excel_v1.head()

     name location   TV
0  param1      mtm  yes
1  param2    mtm-1  yes
2   athma    vja-1  yes
3  athma2    vja-2   no
4    ravi   guduru   no

In [18]:
df_excel_v1.head(2)

     name location   TV
0  param1      mtm  yes
1  param2    mtm-1  yes

In [19]:
df_excel_v1.tail()

     name  location   TV
1  param2     mtm-1  yes
2   athma     vja-1  yes
3  athma2     vja-2   no
4    ravi    guduru   no
5  rakesh  patanpet   no

In [20]:
df_excel_v1.tail(2)

     name  location  TV
4    ravi    guduru  no
5  rakesh  patanpet  no